code-review/NRB_3471_3546/База_Было/Enums/ТипыРазделовСчетовДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРазделовСчетовДЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВТББанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспеченияДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоПоАресту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоИное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоЗапретОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоВЗалоге</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленный</Name>
					<Comment>Блокировано (обособл. на основании федеральных законов и нормативно-правовых актов РФ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленныйПоПредписаниямБР</Name>
					<Comment>Блокировано (обособл. по предписаниям Банка России)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИФИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказаноВИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеНалога</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ИсточникиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИсточникиЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>QUIK</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Панда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУДК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПереводов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ЦБВПути</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ЗаблокированныеЦБвВышестоящемДепозитарии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВстречный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторВстречный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОснования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыНаDMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ОбменДаннымиКафка/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура-обработчик события "ПриЗаписи" документов для добавления в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  Источник - ДокументОбъект - источник события
// 
Процедура ЗаписатьОбъектВИсходящиеСообщенияКафкаПриЗаписиДокумента(Источник) Экспорт
	
	Если ВыполненыУсловияРегистрации(Источник) Тогда
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.СводныйОтчетОСовершенныхОперациях") Тогда
			ДополнительныеПараметры = Новый Структура("СводныйОтчет", Источник);
			ДокументыОперации = ОбщегоНазначения.ВыгрузитьКолонку(Источник.Операции, "ДокументОперации", Истина, Истина);
			Для Каждого ДокументОперации Из ДокументыОперации Цикл
				ЭтоОперацияЦБ = ТипЗнч(ДокументОперации) = Тип("ДокументСсылка.ОперацииЦБ");
				Если (Не ЭтоОперацияЦБ) Или (ЭтоОперацияЦБ И ВыполненыУсловияРегистрации(ДокументОперации)) Тогда
					СформироватьЗаписьВЖурналИсходящихСообщенийКафка(ДокументОперации, ДополнительныеПараметры);
				КонецЕсли;
			КонецЦикла;
		Иначе
			СформироватьЗаписьВЖурналИсходящихСообщенийКафка(Источник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру заполненного MessageInfo для нового сообщения
// Параметры:
//  УИД - Строка - Уникальный идентификатор источника сообщения в виде строки
// Возвращаемое значение:
//  MessageInfo - Структура - новая заполненная структура блока MessageInfo
Функция ДанныеMessageInfo(УИД = Неопределено) Экспорт
	
	Если УИД = Неопределено Тогда
		УИД = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.SystemSource = "Depo";
	MessageInfo.MessageId = УИД;
	MessageInfo.MasterMessageId = УИД;
	MessageInfo.DateTimeCreate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	
	Возврат MessageInfo;
	
КонецФункции

// Возвращает подготовленный блок Data для сообщения об ошибке
// Возвращаемое значение:
//  Data - Структура - новая структура блока Data
Функция СообщениеОбОшибкеБлокData() Экспорт

	Data = Новый Структура;
	Data.Вставить("ErrorCode", "");
	Data.Вставить("SystemSource", "Depo");
	Data.Вставить("DateTimeCreate", ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO));
	Data.Вставить("ErrorDescription", "");
	Data.Вставить("ErrorCodeExternal", "");
	Data.Вставить("UserId", "");
	Data.Вставить("CrmClientId", "");
	
	Возврат Data;

КонецФункции

// Процедура, отмечающая запись в в РС ЖурналВходящихСообщенийKafka как ошибочную
//
// Параметры:
//  ИмяСобытия - Строка - имя события, в котором возникла ошибка
//  СлужебныеДанные - Структура - Структура MessageInfo
//  ТекстОшибки - Строка - текст ошибки
//
Процедура ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, СлужебныеДанные, ТекстОшибки) Экспорт
	
	ОписаниеОшибки = "";
	Если СлужебныеДанные.Свойство("ОписаниеОшибки", ОписаниеОшибки) Тогда
		ОписаниеОшибки = ТекстОшибки + Символы.ПС + ОписаниеОшибки;
	Иначе
		ОписаниеОшибки = ТекстОшибки;
	КонецЕсли;
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	
	ИдентификаторСообщения = СлужебныеДанные.MessageId;
	ДанныеОтвета = СообщениеОбОшибке(ИдентификаторСообщения, ТекстОшибки);
	ДанныеОтвета.Вставить("Ключ", СлужебныеДанные.MessageType);
	Кафка.ОтправитьОшибкуОбработки(ДанныеОтвета);

КонецПроцедуры

// Возвращает подготовленную структуру для сообщения об ошибке
// Параметры:
//  MessageId - Строка - Уникальный идентификатор сообщения в виде строки
//  ErrorDescription - Строка - Описание ошибки
// Возвращаемое значение:
//  Результат - Структура - новая структура сообщения об ошибке
Функция СообщениеОбОшибке(MessageId, ErrorDescription) Экспорт
	
	MessageInfo = ДанныеMessageInfo();
	MessageInfo.Вставить("ParentMessageId", MessageId);
	MessageInfo.Вставить("MasterMessageId", MessageId);
	
	Data = СообщениеОбОшибкеБлокData();
	Data.Вставить("ErrorDescription", ErrorDescription);
	
	Результат = Новый Структура("MessageInfo, Data", MessageInfo, Data);
	Возврат Результат;
	
КонецФункции

// Процедура добавления данных набора записей в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  ТекстJSON			 - Строка			 - сформированный текст JSON для записи в РС ЖурналИсходящихСообщенийKafka
//  ВнешнийИсточник		 - ПланыВидовХарактеристик.ВнешниеИсточники	- топик
//  Идентификатор 		 - Строка			 - идентификатор записи в РС ЖурналИсходящихСообщенийKafka
//  РегистраторСсылка	 - ДокументСсылка	 - ссылка на источник события
//
Процедура ЗаписатьДанныеНабораЗаписиВИсходящиеСообщенияКафка(ТекстJSON, ВнешнийИсточник, Идентификатор, РегистраторСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		Ключ = "AccrualDepoComission";
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, Идентификатор, РегистраторСсылка);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает список сформированных текстов JSON для записи в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  ДанныеРегистратора	 - СтрокаТаблицыЗначений, Структура - содержит свойства:
//      * Номер - Строка - Номер документа
//      * Дата - Дата - Дата документа
//      * Документ - ДокументСсылка - Ссылка на документ, которым начислена комиссия
//  ДанныеПоУслугам		 - Массив - Строки таблицы значений с данными по услугам депозитария
// 
// Возвращаемое значение:
//  ТекстJSON - СписокЗначений - сформированный список строк (текстов) JSON
//
Функция УслугиДепозитарияТекстыJSON(ДанныеРегистратора, ДанныеПоУслугам) Экспорт
	
	ТекстыJSON = Новый СписокЗначений;
	
	Для Каждого ИнформацияПоУслуге Из ДанныеПоУслугам Цикл
		
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		MessageId = MessageInfo.MessageId;
		MessageInfo.MessageType = "AccrualDepoComission";
		MessageInfo.JsonVersion = "1.0.02";
		MessageInfo.ActionType = "INS";
		
		ИдОперации = СтрШаблон("%1Ком%2Строка%3", ДанныеРегистратора.Номер, ИнформацияПоУслуге.КодКомиссии,
		ИнформацияПоУслуге.НомерСтрокиВРегистре);
		ТекстНДС = ?(ЗначениеЗаполнено(ИнформацияПоУслуге.НДСКомиссии), ", " + ИнформацияПоУслуге.НДСКомиссии, "");
		Comment = СтрШаблон("%1%2", "Депозитарная комиссия", ТекстНДС);
		Data = Новый Структура;
		Data.Вставить("ObjectVersion", 1);
		Data.Вставить("Date", ЗаписатьДатуJSON(ИнформацияПоУслуге.Период, ФорматДатыJSON.ISO));
		Data.Вставить("PDocNum", ДанныеРегистратора.Номер);
		Data.Вставить("PDocName", Строка(ТипЗнч(ДанныеРегистратора.Документ)));
		Data.Вставить("PDocDate", ЗаписатьДатуJSON(ДанныеРегистратора.Дата, ФорматДатыJSON.ISO));
		Data.Вставить("OperationId", ИдОперации);
		Data.Вставить("Comment", Comment);
		Data.Вставить("Value", ИнформацияПоУслуге.Сумма);
		Data.Вставить("Code", ИнформацияПоУслуге.КодКомиссии);
		Data.Вставить("Name", ИнформацияПоУслуге.НаименованиеКомиссии);
		Data.Вставить("CurrencyCode", ИнформацияПоУслуге.КодВалюты);
		Data.Вставить("ContractNumber", СокрЛП(ИнформацияПоУслуге.НаименованиеДоговора));
		Data.Вставить("CrmClientId", ИнформацияПоУслуге.CrmClientId);
		Data.Вставить("CalculationPeriod", Формат(ИнформацияПоУслуге.ПериодРасчета, "ДФ=dd.MM.yyyy"));
		
		ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
		ТекстыJSON.Добавить(ТекстJSON, MessageId);
		
	КонецЦикла;
	
	Возврат ТекстыJSON;
	
КонецФункции

// Возвращает список сформированных текстов JSON для записи в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  ДанныеРегистратора	 - СтрокаТаблицыЗначений, Структура - содержит свойства:
//      * Номер - Строка - Номер документа
//      * Дата - Дата - Дата документа
//      * Документ - ДокументСсылка - Ссылка на документ, которым начислена комиссия
//  ДанныеПоУслугам		 - Массив - Строки таблицы значений с данными по услугам депозитария
// 
// Возвращаемое значение:
//  ТекстJSON - СписокЗначений - сформированный список строк (текстов) JSON
//
Функция УслугиДепозитарияТолькоДепозитарноеОбслуживаниеТекстыJSON(ДанныеРегистратора, ДанныеПоУслугам) Экспорт
	
	ТекстыJSON = Новый СписокЗначений;
	
	Для Каждого ИнформацияПоУслуге Из ДанныеПоУслугам Цикл
		
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		MessageId = MessageInfo.MessageId;
		MessageInfo.MessageType = "AccrualDepoComission";
		MessageInfo.JsonVersion = "1.0.02";
		MessageInfo.ActionType = "INS";
		
		ИдОперации = СтрШаблон("%1Ком%2Строка%3", ДанныеРегистратора.Номер, ИнформацияПоУслуге.КодКомиссии,
		ИнформацияПоУслуге.НомерСтрокиВРегистре);
		ТекстНДС = ?(ЗначениеЗаполнено(ИнформацияПоУслуге.НДСКомиссии), ", " + ИнформацияПоУслуге.НДСКомиссии, "");
		Comment = СтрШаблон("%1%2", "Депозитарная комиссия", ТекстНДС);
		Data = Новый Структура;
		Data.Вставить("OnlyDepoService", ИнформацияПоУслуге.КлиентОтсутствуетВBQ);
		Data.Вставить("ObjectVersion", 1);
		Data.Вставить("Date", ЗаписатьДатуJSON(ИнформацияПоУслуге.Период, ФорматДатыJSON.ISO));
		Data.Вставить("PDocNum", ДанныеРегистратора.Номер);
		Data.Вставить("PDocName", Строка(ТипЗнч(ДанныеРегистратора.Документ)));
		Data.Вставить("PDocDate", ЗаписатьДатуJSON(ДанныеРегистратора.Дата, ФорматДатыJSON.ISO));
		Data.Вставить("OperationId", ИдОперации);
		Data.Вставить("Comment", Comment);
		Data.Вставить("Value", ИнформацияПоУслуге.Сумма);
		Data.Вставить("Code", ИнформацияПоУслуге.КодКомиссии);
		Data.Вставить("Name", ИнформацияПоУслуге.НаименованиеКомиссии);
		Data.Вставить("CurrencyCode", ИнформацияПоУслуге.КодВалюты);
		Data.Вставить("ContractNumber", СокрЛП(ИнформацияПоУслуге.НаименованиеДоговора));
		Data.Вставить("CrmClientId", ?(ЗначениеЗаполнено(ИнформацияПоУслуге.CrmClientId), ИнформацияПоУслуге.CrmClientId, Неопределено));
		Data.Вставить("DirectDebitingOfMoney", ИнформацияПоУслуге.БезАкцептноеСписание);
		Data.Вставить("AccountNumber", ИнформацияПоУслуге.НомерСчетаСписанияКомиссии);
		Data.Вставить("CalculationPeriod", Формат(ИнформацияПоУслуге.ПериодРасчета, "ДФ=dd.MM.yyyy"));
		ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
		ТекстыJSON.Добавить(ТекстJSON, MessageId);
		
	КонецЦикла;
	
	Возврат ТекстыJSON;
	
КонецФункции

// Возвращает структуру MessageInfo заполненую для типового случая
// Параметры:
//  MessageType - Строка - Тип сообщения, например "EmailGen"
//  ActionType - Строка - Тип действия, например "INS" или "UPD"
//  JsonVersion - Строка - версия JSON, если Неопределено то "1.0.0"
//  УИДСообщения - Строка - Уникальный идентификатор источника сообщения в виде строки
// Возвращаемое значение:
//  MessageInfo - Структура - полностью заполненная для типового случая структура блока MessageInfo
Функция ТиповыеДанныеMessageInfo(MessageType, ActionType, JsonVersion = "1.0.0", УИДСообщения = Неопределено) Экспорт
	MessageInfo = ДанныеMessageInfo(УИДСообщения);
	
	MessageInfo.JsonVersion = JsonVersion;
	MessageInfo.ActionType = ActionType;
	MessageInfo.MessageType = MessageType;
	
	Возврат MessageInfo;
КонецФункции

// Отправляет почтовое сообщение через Kafka
// Параметры:
//  EmailПолучателя - Строка
//  MailTemplateTitle - Строка - Title шаблона почтового сообщения
//  ReplaceFields - Структура - Заменяемые поля в шаблоне - имена заменяемых полей и их значения, например "ЗаголовокСообщения".
//  							Состав заменяемых полей зависит от шаблона, причем отправка, не всех ключей или лишних ключей
//								ведет к ошибкам согласно документации на модель сущности EmailGen. Может быть Неопределено, тогда
//								ReplaceFields в JSON добавлено не будет.
//  Вложения - Массив - Массив структур со следующими полями: 
//  							fileName (Строка - имя файла без пути и расширения),
//  							fileExt (Строка - расширение файла)
//  							fileBody (Данные файла - Base64Строка)
//  ОтправляемыйОбъект - Ссылка - ссылка на объект ИБ, с которым связано сообщение, может быть Неопредлено
Процедура ОтправитьПочтовоеУведомление(EmailПолучателя, MailTemplateTitle, ReplaceFields = Неопределено, Вложения = Неопределено,
										ОтправляемыйОбъект = Неопределено) Экспорт
	Data = Новый Структура();
	Data.Вставить("Email", EmailПолучателя);
	Data.Вставить("MailTemplateId", Неопределено);
	Data.Вставить("MailTemplateTitle", MailTemplateTitle);
	Если ReplaceFields <> Неопределено Тогда
		Data.Вставить("ReplaceFields", ReplaceFields);
	КонецЕсли;
	Если Вложения <> Неопределено Тогда
		Data.Вставить("Attachments", Вложения);
	КонецЕсли;
	
	MessageInfo = ТиповыеДанныеMessageInfo("EmailGen", "INS");
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaEmailGen;	// Текущее наименование в ИБ Multi.Email.EmailGeneratorIn
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, "EmailGen", ТекстJSON, , ОтправляемыйОбъект);
КонецПроцедуры

#КонецОбласти

#Область МетодыПроверкиВыполненияУсловийРегистрацииОбъектов

Функция ВыполненыУсловияРегистрацииОперацияПеревод(Источник)
	
	ТипРазделаСчетаДЕПО				 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепо			, "ТипРазделаСчетаДЕПО");
	ТипРазделаСчетаДЕПОПолучатель	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепоПолучатель	, "ТипРазделаСчетаДЕПО");
	
	ЭтоПереводМеждуРазделамиСчетаДепоНаБлокировочныйРаздел =
		Источник.ВидОперацииД = Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо
			И (ТипРазделаСчетаДЕПО = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты
				Или ТипРазделаСчетаДЕПОПолучатель = Перечисления.ТипыРазделовСчетовДЕПО.БлокированоРасчеты);
				
	Если Источник.Депонент = Источник.Получатель Тогда
		ЭтоСменаМХ = (Источник.СчетДЕПОМХ <> Источник.СчетДепоМХПолучатель) ИЛИ (Источник.РазделСчетаДЕПОМХ <> Источник.РазделСчетаДепоМХПолучатель);
	Иначе
		ЭтоСменаМХ = Истина;
	КонецЕсли;
				
	Возврат Не ЭтоПереводМеждуРазделамиСчетаДепоНаБлокировочныйРаздел И Источник.Проведен И ЭтоСменаМХ
			И Источник.Дата >= ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ДатаНачалаОбменаНеторговымиОперациями");
	
КонецФункции

Функция ВыполненыУсловияРегистрацииОперацииСписаниеЗачисление(Источник)
	
	Возврат (Источник.ВидОперацииД = Справочники.ВидыОпераций.Депонирование
		Или Источник.ВидОперацииД = Справочники.ВидыОпераций.СнятиеСДепонирования)
		И (Источник.Проведен Или БылаВыгрузкаВКафка(Источник.Ссылка))
		И Не Источник.ИсключитьИзОбменаДанными;
		
КонецФункции

Функция ВыполненыУсловияРегистрации(Источник)
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.Поручение") Или ТипИсточника = Тип("ДокументСсылка.Поручение") Тогда
		
		ВыполненыУсловия = ВыполненыУсловияРегистрацииПоручения(Источник);
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ОперацииЦБ") Или ТипИсточника = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		
		Если Справочники.ВидыОпераций.ЭтоПереводЦБ(Источник.ВидОперацииД) Тогда
			ВыполненыУсловия = ВыполненыУсловияРегистрацииОперацияПеревод(Источник);
		Иначе
			ВыполненыУсловия = ВыполненыУсловияРегистрацииОперацииСписаниеЗачисление(Источник);
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СводныйОтчетОСовершенныхОперациях")
		Или ТипИсточника = Тип("ДокументСсылка.СводныйОтчетОСовершенныхОперациях") Тогда
		
		ВыполненыУсловия = ВыполненыУсловияРегистрацииСводныйОтчетОСовершенныхОперациях(Источник);
		
	Иначе
		
		ВыполненыУсловия = Ложь;
		
	КонецЕсли;
	
	Возврат ВыполненыУсловия;
	
КонецФункции
	
Функция ВыполненыУсловияРегистрацииПоручения(Источник)
	
	ВыполненыУсловия = Ложь;
	
	ЭтоВыкупСписаниеИлиПогашениеЦБ = (Источник.ВидОперацииД = Справочники.ВидыОпераций.ВыкупСписаниеЦБ
	Или Источник.ВидОперацииД = Справочники.ВидыОпераций.Погашение);
	
	СтатусПодходит = Истина;
	
	Если ЭтоВыкупСписаниеИлиПогашениеЦБ Тогда
		Статус = РегистрыСведений.СтатусыПоручений.СтатусПоручения(Источник.Ссылка);
		СтатусПодходит = (Статус = Перечисления.СтатусыПоручений.Исполнено);
	КонецЕсли;
	
	ВыполненыУсловия = ЗначениеЗаполнено(Источник.ДатаИсполненияПоручения)
		И (Источник.ВидОперацииД = Справочники.ВидыОпераций.Конвертация Или ЭтоВыкупСписаниеИлиПогашениеЦБ)
		И (СтатусПодходит Или БылаВыгрузкаВКафка(Источник.Ссылка));
	
	Возврат ВыполненыУсловия;

КонецФункции

Функция ВыполненыУсловияРегистрацииСводныйОтчетОСовершенныхОперациях(Источник)
	
	УсловияВыполнены = Ложь;
	
	ДопустимыеВидыОпераций = Новый Массив;
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Депонирование);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.СнятиеСДепонирования);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.ВыкупСписаниеЦБ);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Погашение);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Перевод);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо);
	ДопустимыеВидыОпераций.Добавить(Справочники.ВидыОпераций.Перемещение);
	
	Для Каждого Операция Из Источник.Операции Цикл
		Если ДопустимыеВидыОпераций.Найти(Операция.ТипОперации) <> Неопределено Тогда
			УсловияВыполнены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат УсловияВыполнены;

КонецФункции
	
#КонецОбласти

#Область ФормированиеТекстаСообщенияДляЖурналИсходящихСообщенийКафка

Функция ОперацияЦБТекстJSON(Источник, ДополнительныеПараметры)
	
	ТекстJSON = "";
	Transactions = Новый Массив;
	
	MessageInfo = MessageInfoWithActionType(Источник, ДополнительныеПараметры);
	Если MessageInfo.ActionType <> "INS" Тогда
		MessageInfo.MessageId = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить().Код;
	ВидОперации = ДополнительныеПараметры.ВидОперации;
	Если ВидОперации = Справочники.ВидыОпераций.Депонирование Или ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		MessageInfo.MessageType = "TransactionSec";
		MessageInfo.JsonVersion = "1.1.0";
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ Или ВидОперации = Справочники.ВидыОпераций.Погашение Тогда
		MessageInfo.MessageType = "Redemption";
		MessageInfo.JsonVersion = "1.0.1";
	ИначеЕсли Справочники.ВидыОпераций.ЭтоПереводЦБ(ВидОперации) Тогда
		MessageInfo.MessageType = "TransactionTransf";
		MessageInfo.JsonVersion = "1.0.1";
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Конвертация Тогда
		Отказ = Ложь;
		ДобавитьДанныеОперацииКонвертацияЦБ(MessageInfo, Transactions, ВалютаРеглУчета, Источник, Отказ);
		Если Отказ Тогда
			Возврат ТекстJSON;
		КонецЕсли;
	Иначе
		Возврат ТекстJSON;
	КонецЕсли;
	
	Data = ДанныеДокумента(Источник, ДополнительныеПараметры);
	
	Если Transactions.Количество() Тогда
		Data.Вставить("Transactions", Transactions);
	КонецЕсли;
	
	Если MessageInfo.MessageType = "TransactionSec" 
			И ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацииЦБ")
			И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
		Data.Вставить("NoLimit", Источник.ДокументОснование.ИсточникЗагрузки = Перечисления.ИсточникиЗагрузки.QUIK);
	КонецЕсли;
	
	ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстJSON;
	
КонецФункции

Процедура ДобавитьДанныеОперацииКонвертацияЦБ(MessageInfo, Transactions, ВалютаРеглУчета, Источник, Отказ)
	
	Перем Transaction, СтрокаТЧ;
	
	MessageInfo.MessageType = "TransactionConv";
	MessageInfo.JsonVersion = "1.0.03";
	
	Если Не Источник.Списание.Количество() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Источник.Зачисление.Количество() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ВидОперацииИсточника = ВидОперацииДокумента(Неопределено, Источник);
	Для Каждого СтрокаТЧ Из Источник.Списание Цикл
		Transaction = ДанныеTransaction(ВалютаРеглУчета, ВидОперацииИсточника, СтрокаТЧ, "CT_SEC_OUT");
		Transactions.Добавить(Transaction);
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Источник.Зачисление Цикл
		Transaction = ДанныеTransaction(ВалютаРеглУчета, ВидОперацииИсточника, СтрокаТЧ, "CT_SEC_IN");
		Transactions.Добавить(Transaction);
	КонецЦикла;

КонецПроцедуры

Функция ДанныеДокумента(Источник, ДополнительныеПараметры)
	
	ДанныеДокумента = Новый Структура;
	
	Если Справочники.ВидыОпераций.ЭтоПереводЦБ(ДополнительныеПараметры.ВидОперации) Тогда
		ЗаполнитьДанныеОперацииЦБПеревод(ДанныеДокумента, Источник, ДополнительныеПараметры);
	ИначеЕсли ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ
		Или ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.Погашение Тогда
		ЗаполнитьДанныеПорученияВыкупСписаниеПогашение(ДанныеДокумента, Источник, ДополнительныеПараметры);
	ИначеЕсли ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.Депонирование
		Или ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		ЗаполнитьДанныеОперацииЦБЗачислениеСписание(ДанныеДокумента, Источник, ДополнительныеПараметры);
	ИначеЕсли ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.Конвертация Тогда
		ЗаполнитьДанныеОперацииЦБКонвертация(ДанныеДокумента, Источник);
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ДанныеTransaction(ВалютаРеглУчета, ВидОперации, ДанныеТранзакции, TransactionType)
	
	Transaction = Новый Структура;
	
	Asset = ДанныеЦБ(?(ВидОперации = Справочники.ВидыОпераций.Конвертация, ДанныеТранзакции.ЦеннаяБумага, ДанныеТранзакции.ЦБ));
	
	Transaction.Вставить("Asset", Asset);
	Transaction.Вставить("Count", ДанныеТранзакции.Количество);
	Transaction.Вставить("TransactionType", TransactionType);
	Если Справочники.ВидыОпераций.ЭтоПереводЦБ(ВидОперации) Тогда
		ФизЛицоПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТранзакции.Получатель, "ФизЛицо");
		Transaction.Вставить("CrmClientId", Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ФизЛицоПолучателя));
		Transaction.Вставить("getDepoMxDivisionCode",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТранзакции.РазделСчетаДепоМХПолучатель, "Код"));
		Transaction.Вставить("getDivisionCode",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТранзакции.РазделСчетаДепоПолучатель, "Код"));
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Конвертация Тогда
		СчетДепо = СчетДепоВТабличнойЧастиДокумента(ДанныеТранзакции);
		Transaction.Вставить("DepoAccountCode",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетДепо, "Код"));
		Transaction.Вставить("DepoMxDivisionCode",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТранзакции.РазделСчетаДепоМХ, "Код"));
	КонецЕсли;
	
	Возврат Transaction;
	
КонецФункции

Функция ДанныеЦБ(ЦеннаяБумага)
	
	Asset = Новый Структура("Isin, NrdCode, RegNum");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникЦенныеБумаги.Ссылка КАК Ссылка,
		|	СправочникЦенныеБумаги.ISIN КАК ISIN,
		|	СправочникЦенныеБумаги.НомерРегистрации КАК НомерРегистрации
		|ПОМЕСТИТЬ ВТ_ЦБ
		|ИЗ
		|	Справочник.ЦенныеБумаги КАК СправочникЦенныеБумаги
		|ГДЕ
		|	СправочникЦенныеБумаги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(КодыЗагрузки.Код, """") КАК NrdCode,
		|	ВТ_ЦБ.ISIN КАК Isin,
		|	ВТ_ЦБ.НомерРегистрации КАК RegNum
		|ИЗ
		|	ВТ_ЦБ КАК ВТ_ЦБ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
		|		ПО ВТ_ЦБ.Ссылка = КодыЗагрузки.Владелец
		|			И (ВЫБОР
		|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
		|			КОНЕЦ)
		|			И (КодыЗагрузки.Биржа = &КлассификаторНДЦ)";
	
	Запрос.УстановитьПараметр("КлассификаторНДЦ", Справочники.КлассификаторыЗагрузки.NrdCode);
	Запрос.УстановитьПараметр("Ссылка", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Asset.Isin = СокрЛП(ВыборкаДетальныеЗаписи.Isin);
		Asset.NrdCode = СокрЛП(ВыборкаДетальныеЗаписи.NrdCode);
		Asset.RegNum = СокрЛП(ВыборкаДетальныеЗаписи.RegNum);
	КонецЕсли;
	
	Возврат Asset;
	
КонецФункции

Функция ДанныеПоСделкамОперации(ОперацияЦБ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Поручение.ТипПеревода = &ТипПереводаСписание
	|				ТОГДА Поручение.НомерПорученияВБО
	|			КОГДА ПоручениеВстречное.ТипПеревода = &ТипПереводаСписание
	|				ТОГДА ПоручениеВстречное.НомерПорученияВБО
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК НомерПорученияВБО1,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Поручение.ТипПеревода = &ТипПереводаЗачисление
	|				ТОГДА Поручение.НомерПорученияВБО
	|			КОГДА ПоручениеВстречное.ТипПеревода = &ТипПереводаЗачисление
	|				ТОГДА ПоручениеВстречное.НомерПорученияВБО
	|		КОНЕЦ, НЕОПРЕДЕЛЕНО) КАК НомерПорученияВБО2
	|ИЗ
	|	Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО ОперацииЦБ.ДокументОснование = Поручение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК ПоручениеВстречное
	|		ПО ОперацииЦБ.ДокументОснованиеВстречный = ПоручениеВстречное.Ссылка
	|ГДЕ
	|	ОперацииЦБ.Ссылка = &ОперацияЦБ";
	
	Запрос.УстановитьПараметр("ОперацияЦБ", ОперацияЦБ);
	Запрос.УстановитьПараметр("ТипПереводаЗачисление", Перечисления.ТипыПереводов.Зачисление);
	Запрос.УстановитьПараметр("ТипПереводаСписание", Перечисления.ТипыПереводов.Списание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Trades = Новый Структура;
	Trades.Вставить("ExternalId", Выборка.НомерПорученияВБО1);
	Trades.Вставить("GetExternalId", Выборка.НомерПорученияВБО2);
	
	Возврат Trades;
	
КонецФункции

Процедура СформироватьЗаписьВЖурналИсходящихСообщенийКафка(Источник, ДополнительныеПараметры = Неопределено)
	
	Если ЭтоОперацияЦБСводногоПоручения(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	
	ДанныеПоручения = Неопределено;
	Если ТипИсточника = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДокументОснование");
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение") Тогда
			ДанныеПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,
				"ВидОперацииД, Номер, Дата, ДатаИсполненияПоручения, ЦенныеБумагиСписываемые, Комментарий");
			ДанныеПоручения.Вставить("Поручение", ДокументОснование);
			ДополнительныеПараметры.Вставить("ДанныеПоручения", ДанныеПоручения);
		КонецЕсли;
	КонецЕсли;
	
	ВидОперации = ВидОперацииДокумента(ДанныеПоручения, Источник);
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ВидОперации", ВидОперации);
	
	Если ВидОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ Или ВидОперации = Справочники.ВидыОпераций.Погашение Тогда
		ЗаписатьВОчередьКафкаПогашениеВыкупСписаниеЦБ(Источник, ДополнительныеПараметры, ТипИсточника, ДанныеПоручения);
	Иначе
		ПодготовитьТекстСообщенияИЗаписатьВОчередьКафка(Источник, ДополнительныеПараметры, Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Функция БылаВыгрузкаВКафка(ДокументСсылка, ДополнительныеПараметры = Неопределено)
	
	DepoId = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("СтрокаТЧ") Тогда
		DepoId = ДополнительныеПараметры.СтрокаТЧ.DepoId;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыгруженныеОперацииСЦБ.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ВыгруженныеОперацииСЦБ КАК ВыгруженныеОперацииСЦБ
	|ГДЕ
	|	ВыгруженныеОперацииСЦБ.Объект = &Документ
	|	И &УсловиеПоИдентификатору";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	Если ЗначениеЗаполнено(DepoId) Тогда
		УсловиеПоИдентификатору = "ВыгруженныеОперацииСЦБ.DepoId = &DepoId";
		Запрос.УстановитьПараметр("DepoId", DepoId);
	Иначе
		УсловиеПоИдентификатору = "Истина";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИдентификатору", УсловиеПоИдентификатору);
	
	РезультатЗапроса = Запрос.Выполнить();
	БылаВыгрузкаВКафка = ?(Не РезультатЗапроса.Пустой(), Истина, Ложь);
	Возврат БылаВыгрузкаВКафка;

КонецФункции

Процедура ЗаполнитьДанныеОперацииЦБКонвертация(ДанныеДокумента, Источник)
	
	ДанныеДокумента.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(Источник.Ссылка) + 1);
	ДанныеДокумента.Вставить("OperationNum", СокрЛП(Источник.Номер));
	ДанныеДокумента.Вставить("Date", ЗаписатьДатуJSON(Источник.Дата, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("FixDate", ЗаписатьДатуJSON(Источник.ДатаФиксации, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("Number", Источник.НомерОтчета);
	ДанныеДокумента.Вставить("ConvertationType", "MON_CHANGE");
	ДанныеДокумента.Вставить("Rate", Источник.КоэффициентКонвертации);

КонецПроцедуры

Процедура ЗаполнитьДанныеОперацииЦБПеревод(ДанныеДокумента, Источник, ДополнительныеПараметры)
	
	ИмяРеквизитаКод = "Код";
	ИмяРеквизитаСчетДепо = "СчетДепо";
	
	ДанныеДокумента.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(Источник.Ссылка) + 1);
	ДанныеДокумента.Вставить("OperationNum", СокрЛП(Источник.Номер));
	ДанныеДокумента.Вставить("Date", ЗаписатьДатуJSON(Источник.Дата, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("DepoId", Строка(Источник.Ссылка.УникальныйИдентификатор()));
	
	ДанныеДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Депонент, "ЮридическиеФизическиеЛица");
	ДанныеДокумента.Вставить("CrmClientId",
		Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ДанныеДепонента.ЮридическиеФизическиеЛица));
	ДанныеДокумента.Вставить("ContractNumber",
		Обработки.РегистрацияКлиентаЧерезKafka.CrmContractNumber(Источник.Депонент));
	ДанныеДокумента.Вставить("DepoDivisionCode",
		СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепо, ИмяРеквизитаКод)));
	ДанныеДокумента.Вставить("DepoMxDivisionCode",
		СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепоМХ, ИмяРеквизитаКод)));
	ДанныеДокумента.Вставить("DepoMxFactCode",
		СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.СчетДепоМХ, ИмяРеквизитаКод)));
	ДанныеДокумента.Вставить("OnlyDepoClient", Источник.Депонент.КлиентОтсутствуетВBQ);
	ДополнительныеПараметры.Вставить(ИмяРеквизитаСчетДепо, Источник.СчетДепо);
	ДанныеСводногоОтчета = ДанныеСводногоОтчета(Источник, ДополнительныеПараметры);
	ДанныеДокумента.Вставить("DocNum", СокрЛП(ДанныеСводногоОтчета.СводныйОтчетНомер));
	ДанныеДокумента.Вставить("DocDate", ДанныеСводногоОтчета.СводныйОтчетДата);
	PDocName = ?(ЗначениеЗаполнено(ДанныеСводногоОтчета.СводныйОтчетНомер), "Сводный отчет о совершенных операциях", "");
	ДанныеДокумента.Вставить("DocName", PDocName);
	Если ЗначениеЗаполнено(Источник.Получатель) Тогда
		ДанныеПолучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Получатель, "ЮридическиеФизическиеЛица");
		ДанныеДокумента.Вставить("GetCrmClientId",
			Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ДанныеПолучателя.ЮридическиеФизическиеЛица));
		ДанныеДокумента.Вставить("GetContractNumber",
			Обработки.РегистрацияКлиентаЧерезKafka.CrmContractNumber(Источник.Получатель));
		ДанныеДокумента.Вставить("GetDepoDivisionCode",
			СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепоПолучатель, ИмяРеквизитаКод)));
		ДанныеДокумента.Вставить("GetDepoMxDivisionCode",
			СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепоМХПолучатель, ИмяРеквизитаКод)));
		ДанныеДокумента.Вставить("GetDepoMxFactCode",
			СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.СчетДепоМХПолучатель, ИмяРеквизитаКод)));
		ДанныеДокумента.Вставить("GetOnlyDepoClient", Источник.Получатель.КлиентОтсутствуетВBQ);
	Иначе
		ДанныеДокумента.Вставить("GetCrmClientId", Неопределено);
		ДанныеДокумента.Вставить("GetContractNumber", Неопределено);
		ДанныеДокумента.Вставить("GetDepoDivisionCode", Неопределено);
		ДанныеДокумента.Вставить("GetDepoMxDivisionCode", Неопределено);
		ДанныеДокумента.Вставить("GetDepoMxFactCode", Неопределено);
	КонецЕсли;	
	ДополнительныеПараметры.Вставить(ИмяРеквизитаСчетДепо, Источник.СчетДепоПолучатель);
	ДанныеСводногоОтчета = ДанныеСводногоОтчета(Источник, ДополнительныеПараметры);
	ДанныеДокумента.Вставить("GetDocNum", СокрЛП(ДанныеСводногоОтчета.СводныйОтчетНомер));
	ДанныеДокумента.Вставить("GetDocDate", ДанныеСводногоОтчета.СводныйОтчетДата);
	PDocName = ?(ЗначениеЗаполнено(ДанныеСводногоОтчета.СводныйОтчетНомер), "Сводный отчет о совершенных операциях", "");
	ДанныеДокумента.Вставить("GetDocName", PDocName);
	ДополнительныеПараметры.Удалить(ИмяРеквизитаСчетДепо);
	
	Asset = ДанныеЦБ(Источник.ЦБ);
	Asset.Вставить("Qty", Источник.Количество);
	ДанныеДокумента.Вставить("Asset", Asset);
	
	Trades = ДанныеПоСделкамОперации(Источник.Ссылка);
	ДанныеДокумента.Вставить("Trades", Trades);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОперацииЦБЗачислениеСписание(ДанныеДокумента, Источник, ДополнительныеПараметры)
	
	ДанныеДокумента.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(Источник.Ссылка) + 1);
	ДанныеДокумента.Вставить("TransactionType", ?(ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.Депонирование,
		"CT_SEC_IN", "CT_SEC_OUT"));
	ДанныеДокумента.Вставить("OperationNum", СокрЛП(Источник.Номер));
	ДанныеДокумента.Вставить("Date", ЗаписатьДатуJSON(Источник.Дата, ФорматДатыJSON.ISO));
	ДанныеДокумента.Вставить("DepoId", Строка(Источник.Ссылка.УникальныйИдентификатор()));
	
	ДанныеДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Депонент, "ЮридическиеФизическиеЛица");
	ДанныеДокумента.Вставить("CrmClientId", Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ДанныеДепонента.ЮридическиеФизическиеЛица));
	ДанныеДокумента.Вставить("ContractNumber", Обработки.РегистрацияКлиентаЧерезKafka.CrmContractNumber(Источник.Депонент));
	ДанныеДокумента.Вставить("DepoNumber", СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.СчетДепо, "Код")));
	ДанныеДокумента.Вставить("DepoMxFactCode", СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.СчетДепоМХ, "Код")));
	ДанныеДокумента.Вставить("DepoDivisionCode", СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепо, "Код")));
	ДанныеДокумента.Вставить("DepoMxDivisionCode", СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.РазделСчетаДепоМХ, "Код")));
	
	ДанныеСводногоОтчета = ДанныеСводногоОтчета(Источник, ДополнительныеПараметры);
	
	ДанныеДокумента.Вставить("PDocNum", СокрЛП(ДанныеСводногоОтчета.СводныйОтчетНомер));
	ДанныеДокумента.Вставить("PDocDate", ДанныеСводногоОтчета.СводныйОтчетДата);
	PDocName = ?(ЗначениеЗаполнено(ДанныеСводногоОтчета.СводныйОтчетНомер), "Сводный отчет о совершенных операциях", "");
	ДанныеДокумента.Вставить("PDocName", PDocName);
	
	Asset = ДанныеЦБ(Источник.ЦБ);
	Asset.Вставить("Qty", Источник.Количество);
	ДанныеДокумента.Вставить("Asset", Asset);

КонецПроцедуры

Функция ВидОперацииДокумента(ДанныеПоручения, Источник)
	
	Если ДанныеПоручения <> Неопределено И ТипЗнч(ДанныеПоручения) = Тип("Структура") И ДанныеПоручения.Свойство("ВидОперацииД") Тогда
		ВидОперации = ДанныеПоручения.ВидОперацииД;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Поручение") Или ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацииЦБ") Тогда
		ВидОперации = Источник.ВидОперацииД;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ВидОперацииД");
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ГлобальнаяОперация") Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ВидГлобальнойОперации");
	Иначе
		ВидОперации = Неопределено;
	КонецЕсли;
	
	Возврат ВидОперации;

КонецФункции

Процедура ПодготовитьТекстСообщенияИЗаписатьВОчередьКафка(Источник, ДополнительныеПараметры, ДокументСсылка)
	
	БылаВыгрузка = БылаВыгрузкаВКафка(ДокументСсылка, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("БылаВыгрузкаВКафка", БылаВыгрузка);
	
	ВидОперации = ДополнительныеПараметры.ВидОперации;
	
	Если ВидОперации = Справочники.ВидыОпераций.Депонирование
		Или ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
		Ключ = "TransactionSec";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaTransactionSec;
	ИначеЕсли Справочники.ВидыОпераций.ЭтоПереводЦБ(ВидОперации) Тогда
		Ключ = "TransactionTransf";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaTransactionTransf;
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.Конвертация Тогда
		Ключ = "TransactionConv";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaTransactionConv;
	ИначеЕсли ВидОперации = Справочники.ВидыОпераций.ВыкупСписаниеЦБ
		Или ВидОперации = Справочники.ВидыОпераций.Погашение Тогда
		Ключ = "Redemption";
		ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaRedemption;
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекстJSON = ОперацияЦБТекстJSON(Источник, ДополнительныеПараметры);
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, , ДокументСсылка);
		Если Не БылаВыгрузка Тогда
			DepoId = ?(ДополнительныеПараметры.Свойство("СтрокаТЧ"), ДополнительныеПараметры.СтрокаТЧ.DepoId, "");
			РегистрыСведений.ВыгруженныеОперацииСЦБ.Добавить(ДокументСсылка, DepoId);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДанныеПорученияВыкупСписаниеПогашение(ДанныеДокумента, Источник, ДополнительныеПараметры)
	
	ДанныеПоручения = Неопределено;
	Если ДополнительныеПараметры.Свойство("ДанныеПоручения") Тогда
		ДанныеПоручения = ДополнительныеПараметры.ДанныеПоручения;
		
		ПоручениеСсылка = ДанныеПоручения.Поручение;
		НомерПоручения = ДанныеПоручения.Номер;
		ДатаИсполненияПоручения = ДанныеПоручения.ДатаИсполненияПоручения;
		Комментарий = ДанныеПоручения.Комментарий;
	Иначе
		ПоручениеСсылка = Источник.Ссылка;
		НомерПоручения = Источник.Номер;
		ДатаИсполненияПоручения = Источник.ДатаИсполненияПоручения;
		Комментарий = Источник.Комментарий;
	КонецЕсли;
	
	ДанныеДокумента.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(ПоручениеСсылка) + 1);
	ДанныеДокумента.Вставить("CLTypeCode", ?(ДополнительныеПараметры.ВидОперации = Справочники.ВидыОпераций.Погашение,
		"redemption", "buyback"));
	ДанныеДокумента.Вставить("OperationNum", СокрЛП(НомерПоручения));
	
	ДанныеДокумента.Вставить("Date", ЗаписатьДатуJSON(ДатаИсполненияПоручения, ФорматДатыJSON.ISO));
	
	ЭтоСтрокаКУдалению = ДополнительныеПараметры.Свойство("ДанныеУдаляемойСтроки");
	
	СтрокаТЧ = ?(ЭтоСтрокаКУдалению, ДополнительныеПараметры.ДанныеУдаляемойСтроки, ДополнительныеПараметры.СтрокаТЧ);
	ИмяРеквизитаКод = "Код";
	ДанныеДокумента.Вставить("DepoId", Строка(СтрокаТЧ.DepoId));
	Депонент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.СчетДепо, "Владелец");
	ДанныеДепонента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Депонент, "ЮридическиеФизическиеЛица");
	ДанныеДокумента.Вставить("CrmClientId", Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ДанныеДепонента.ЮридическиеФизическиеЛица));
	ДанныеДокумента.Вставить("ContractNumber", Обработки.РегистрацияКлиентаЧерезKafka.CrmContractNumber(Депонент));
	ДанныеДокумента.Вставить("DepoDivisionCode", СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.РазделСчетаДепо, ИмяРеквизитаКод)));
	DepoMxFactCode = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.СчетДепоМХ, ИмяРеквизитаКод));
	ДанныеДокумента.Вставить("DepoMxFactCode", DepoMxFactCode);
	DepoMxDivisionCode = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.РазделСчетаДепоМХ, ИмяРеквизитаКод));
	ДанныеДокумента.Вставить("DepoMxDivisionCode", DepoMxDivisionCode);
	
	Asset = ДанныеЦБ(СтрокаТЧ.ЦеннаяБумага);
	ДанныеДокумента.Вставить("Asset", Asset);
	
	ОписаниеРеквизитов = Новый Структура;
	ОписаниеРеквизитов.Вставить("РеференсКД", "КарточкаКД.КДРеференсВходящий");
	РеквизитыПоручения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоручениеСсылка, ОписаниеРеквизитов);
	ДанныеДокумента.Вставить("Reference", ?(ЗначениеЗаполнено(РеквизитыПоручения.РеференсКД), РеквизитыПоручения.РеференсКД, Неопределено));
	
	ДанныеДокумента.Вставить("Qty", СтрокаТЧ.Количество);
	
	ДополнительныеПараметры.Вставить("СчетДепо", Источник.СчетДепо);
	ДанныеСводногоОтчета = ДанныеСводногоОтчета(Источник, ДополнительныеПараметры);
	ДанныеДокумента.Вставить("PDocNum", СокрЛП(ДанныеСводногоОтчета.СводныйОтчетНомер));
	ДанныеДокумента.Вставить("PDocDate", ДанныеСводногоОтчета.СводныйОтчетДата);
	PDocName = ?(ЗначениеЗаполнено(ДанныеСводногоОтчета.СводныйОтчетНомер), "Сводный отчет о совершенных операциях", "");
	ДанныеДокумента.Вставить("PDocName", PDocName);
	
	ДанныеДокумента.Вставить("Comment", СокрЛП(Комментарий));

КонецПроцедуры

Функция ДанныеСводногоОтчета(Источник, ДополнительныеПараметры)
	
	ДанныеСводногоОтчета = Новый Структура("СводныйОтчетНомер, СводныйОтчетДата", "", Неопределено);
	
	СводныйОтчет = Неопределено;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ЭтоСводныйОтчет = ДополнительныеПараметры.Свойство("СводныйОтчет", СводныйОтчет);
	
	Если ЭтоСводныйОтчет И ДополнительныеПараметры.Свойство("СчетДепо") И ДополнительныеПараметры.СчетДепо = СводныйОтчет.СчетДепо Тогда
		ДанныеСводногоОтчета.СводныйОтчетНомер = СводныйОтчет.Номер;
		ДанныеСводногоОтчета.СводныйОтчетДата = СводныйОтчет.Дата;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Номер КАК Номер,
		|	СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
		|ГДЕ
		|	СводныйОтчетОСовершенныхОперацияхОперации.ДокументОперации = &ДокументСсылка
		|	И СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Проведен
		|	И СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Дата >= &КонецДняОперацииЦБ
		|	И &УсловиеПоСчетуДепо
		|	И СводныйОтчетОСовершенныхОперацияхОперации.ДокументОперации ССЫЛКА Документ.ОперацииЦБ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Номер,
		|	СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Дата
		|ИЗ
		|	Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
		|		ПО СводныйОтчетОСовершенныхОперацияхОперации.ДокументОперации = ГлобальнаяОперация.Ссылка
		|ГДЕ
		|	СводныйОтчетОСовершенныхОперацияхОперации.ДокументОперации ССЫЛКА Документ.ГлобальнаяОперация
		|	И СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Проведен
		|	И СводныйОтчетОСовершенныхОперацияхОперации.Ссылка.Дата >= &КонецДняОперацииЦБ
		|	И ГлобальнаяОперация.ДокументОснование = &ДокументСсылка";
		
		Если ДополнительныеПараметры.Свойство("СчетДепо") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСчетуДепо", "СводныйОтчетОСовершенныхОперацияхОперации.НомерСчетаДепо = &СчетДепо");
			Запрос.УстановитьПараметр("СчетДепо", ДополнительныеПараметры.СчетДепо);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСчетуДепо", "Истина");
		КонецЕсли;
		Запрос.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
		Запрос.УстановитьПараметр("КонецДняОперацииЦБ", КонецДня(Источник.Дата));
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДанныеСводногоОтчета.СводныйОтчетНомер = ВыборкаДетальныеЗаписи.Номер;
			ДанныеСводногоОтчета.СводныйОтчетДата = ВыборкаДетальныеЗаписи.Дата;
		КонецЕсли;
	КонецЕсли;

	Возврат ДанныеСводногоОтчета;
	
КонецФункции

Функция MessageInfoWithActionType(Источник, ДополнительныеПараметры)
	
	ЭтоУдалениеСтроки = Ложь;
	Идентификатор = ИдентификаторИсточника(Источник, ДополнительныеПараметры, ЭтоУдалениеСтроки);
	MessageInfo = ДанныеMessageInfo(Идентификатор);
	Если ДополнительныеПараметры.Свойство("СводныйОтчет") Тогда
		MessageInfo.ActionType = "UPD";
	Иначе
		Если Не Источник.Проведен Или ЭтоУдалениеСтроки Тогда
			MessageInfo.ActionType = "DEL";
		Иначе
			MessageInfo.ActionType = ?(ДополнительныеПараметры.Свойство("БылаВыгрузкаВКафка")
				И ДополнительныеПараметры.БылаВыгрузкаВКафка, "UPD", "INS");
		КонецЕсли;
	КонецЕсли;
	
	Возврат MessageInfo;
	
КонецФункции

Функция ИдентификаторИсточника(Источник, ДополнительныеПараметры, ЭтоУдалениеСтроки)
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		Идентификатор = Строка(Источник.УникальныйИдентификатор());
	ИначеЕсли (ТипЗнч(Источник) = Тип("ДокументОбъект.Поручение")
		Или ТипЗнч(Источник) = Тип("ДокументСсылка.ГлобальнаяОперация"))
		И ДополнительныеПараметры.Свойство("СтрокаТЧ") Тогда
		Идентификатор = ДополнительныеПараметры.СтрокаТЧ.DepoId;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Поручение")
		И ДополнительныеПараметры.Свойство("ДанныеУдаляемойСтроки") Тогда
		Идентификатор = ДополнительныеПараметры.ДанныеУдаляемойСтроки.DepoId;
		ЭтоУдалениеСтроки = Истина;
	Иначе
		Идентификатор = Строка(Источник.Ссылка.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

Функция ЭтоОперацияЦБСводногоПоручения(Источник)
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ОперацииЦБ") Тогда
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДокументОснование");
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацииЦБ") Тогда
		ДокументОснование = Источник.ДокументОснование;
	Иначе
		ДокументОснование = Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.иц_СводноеПоручение");
	
КонецФункции

Процедура ЗаписатьВОчередьКафкаПогашениеВыкупСписаниеЦБ(Источник, ДополнительныеПараметры, ТипИсточника, ДанныеПоручения)
	
	Если ДанныеПоручения <> Неопределено Тогда
		ЦенныеБумагиСписываемые = ДанныеПоручения.ЦенныеБумагиСписываемые.Выгрузить();
		ПоручениеСсылка = ДанныеПоручения.Поручение;
	Иначе
		ЦенныеБумагиСписываемые = Источник.ЦенныеБумагиСписываемые;
		ПоручениеСсылка = Источник.Ссылка;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из ЦенныеБумагиСписываемые Цикл
		Если СтрокаТЧ.СчетДепо = Источник.СчетДепо Или ТипИсточника = Тип("ДокументОбъект.Поручение") Тогда
			ДополнительныеПараметры.Вставить("СтрокаТЧ", СтрокаТЧ);
			ПодготовитьТекстСообщенияИЗаписатьВОчередьКафка(Источник, ДополнительныеПараметры, ПоручениеСсылка);
		КонецЕсли;
	КонецЦикла;
	ДополнительныеПараметры.Удалить("СтрокаТЧ");
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Поручение") И Источник.ДополнительныеСвойства.Свойство("СтрокиКУдалению") Тогда
		Для Каждого ДанныеУдаляемойСтроки Из Источник.ДополнительныеСвойства.СтрокиКУдалению Цикл
			ДополнительныеПараметры.Вставить("ДанныеУдаляемойСтроки", ДанныеУдаляемойСтроки);
			ПодготовитьТекстСообщенияИЗаписатьВОчередьКафка(Источник, ДополнительныеПараметры, ПоручениеСсылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СчетДепоВТабличнойЧастиДокумента(ДанныеТранзакции)
	Попытка
		Возврат ДанныеТранзакции.СчетДепо;
	Исключение
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеТранзакции.РазделСчетаДепо, "Владелец");
	КонецПопытки;
КонецФункции

// Процедура формирует сообщение для передачи данных ИНН, ОГРН Эмитента по данным ЦБ РФ, а также ряда других реквизитов
// кодов загрузки эмитента в BackQort.
// в базе в справочнике ЦБ
// Параметры:
//	Данные - ВыборкаИзРезультатаЗапроса - данные о юридическом лице являющимся эмитентом
Процедура ВыгрузитьИНН_ОГРН_ЦБРФ_ЭмитентаВBackQort(Данные) Экспорт
	
	Сущность = "EmitentCBRData";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaDepoToBqSecuritiesStatic1642;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);

	Попытка
		MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "INS", "1.0.0", УИДСообщения);
		ДанныеДляСообщения = Новый Структура;
		ДанныеДляСообщения.Вставить("RuDataCode", РаботаСJSON.ЧисловойКодRuData(СокрЛП(Данные.RuDataCode)) );
		ДанныеДляСообщения.Вставить("NrdCode", СокрЛП(Данные.NrdCode) );
		ДанныеДляСообщения.Вставить("LeiCode", СокрЛП(Данные.LeiCode) );
		ДанныеДляСообщения.Вставить("Tin", Данные.TIN);
		ДанныеДляСообщения.Вставить("Name", Данные.НаименованиеЮЛ);
		ДанныеДляСообщения.Вставить("InnCBR", Данные.ИНН);
		ДанныеДляСообщения.Вставить("OgrnCBR", Данные.ОГРН);
		ДанныеДляСообщения.Вставить("KppCBR", Данные.КПП);
		ДанныеДляСообщения.Вставить("NameCBR", Данные.Наименование);
		ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, ДанныеДляСообщения);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, Данные.ЮрлицоЭмитент);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации("ИНН_ОГРН_ЦБРФ_ЭмитентаВBackQort", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкиВходящихСообщений

// Процедура добавления данных набора записей в РС ЖурналИсходящихСообщенийKafka
//
// Параметры:
//  ИсходныйMessageInfo - Структура - MessageInfo, полученный из входящего сообщения
//  MessageInfo - Строка - Проверенный MessageInfo
//  ИмяСобытия - Строка - имя события, из которого вызвана процедура
//  ТекстОшибки - Строка - текст ошибки
Процедура ПодготовитьMessageInfo(ИсходныйMessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки) Экспорт
	
	MessageInfo.MessageType		= ИсходныйMessageInfo.MessageType;
	MessageInfo.MessageId		= ИсходныйMessageInfo.MessageId;
	MessageInfo.MasterMessageId = ИсходныйMessageInfo.MasterMessageId;
	MessageInfo.ParentMessageId = ИсходныйMessageInfo.ParentMessageId;
	MessageInfo.SystemSource	= ИсходныйMessageInfo.SystemSource;
	MessageInfo.DateTimeCreate	= ПрочитатьДатуJSON(ИсходныйMessageInfo.DateTimeCreate, ФорматДатыJSON.ISO);
	MessageInfo.JsonVersion		= ИсходныйMessageInfo.JsonVersion;
	MessageInfo.ActionType		= ИсходныйMessageInfo.ActionType;
		
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаДанныхСводныхОтчетовПоСделкамVPFI_OTC

// Процедура выгружает из документа Сводный отчет о совершенных операциях данные по первичным документам по VPFI и OTC сделкам
// в Kafka для backQORT. Выгрузка происходит если документ еще не был проведен или в нем есть изменения касающиеся информации
// по VPFI и OTC сделкам по сравнению с его предыдущим состоянием.
// Параметры:
//	СводныйОтчетСсылка - ДокументСсылка.СводныйОтчетОСовершенныхОперациях
//	УжеБылПроведен - Булево
//	ПрошлыеДанныеДляВыгрузки - массив - данные для выгрузки основанные на прошлой версии докмуента (массив структур)
Процедура ВыгрузитьПервичныеДокументыПоСделкамVPFI_OTC(СводныйОтчетСсылка, УжеБылПроведен, ПрошлыеДанныеДляВыгрузки) Экспорт
	ДанныеДляВыгрузки = ДанныеДляВыгрузкиСводногоОтчетаПоСделкамVPFI_OTC(СводныйОтчетСсылка);
	Если Не УжеБылПроведен Или ДанныеДляВыгрузкиИзменились(ПрошлыеДанныеДляВыгрузки, ДанныеДляВыгрузки) Тогда
		Для Каждого ДанныеДляОдногоСообщения Из ДанныеДляВыгрузки Цикл
			ВыгрузитьПервичныйДокумент(ДанныеДляОдногоСообщения, СводныйОтчетСсылка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура возвращает данные по первичным документам по VPFI и OTC сделкам содержащиеся в документе
// СводныйОтчетОСовершенныхОперациях.
// Параметры:
//	СводныйОтчетСсылка - ДокументСсылка.СводныйОтчетОСовершенныхОперациях
// Возвращаемое значение:
//	- Массив - (Массив структур).
Функция ДанныеДляВыгрузкиСводногоОтчетаПоСделкамVPFI_OTC(СводныйОтчетСсылка) Экспорт
	ДанныеДляВыгрузки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СводныйОтчетОСовершенныхОперациях.Дата КАК PDocDate,
		|	СводныйОтчетОСовершенныхОперациях.Номер КАК PDocNum,
		|	СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации.НомерПорученияВБО КАК НомерПорученияВБО,
		|	ЕСТЬNULL(КодыЗагрузкиЮридическиеФизическиеЛица.Код, """") КАК CrmClientId,
		|	ЕСТЬNULL(КодыЗагрузкиКонтрагенты.Код, """") КАК ContractNumber,
		|	ВЫБОР
		|		КОГДА СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации.НомерПорученияВБО ПОДОБНО ""VPFI_%""
		|			ТОГДА ""34""
		|		КОГДА СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации.НомерПорученияВБО ПОДОБНО ""OTC_%""
		|			ТОГДА ""4""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК TypeCode
		|ПОМЕСТИТЬ ВТ_Операции
		|ИЗ
		|	Документ.СводныйОтчетОСовершенныхОперациях КАК СводныйОтчетОСовершенныхОперациях
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СводныйОтчетОСовершенныхОперациях.Операции КАК СводныйОтчетОСовершенныхОперацияхОперации
		|		ПО (СводныйОтчетОСовершенныхОперацияхОперации.Ссылка = СводныйОтчетОСовершенныхОперациях.Ссылка)
		|			И (СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации ССЫЛКА Документ.Поручение)
		|			И (СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации.НомерПорученияВБО ПОДОБНО ""VPFI_%""
		|				ИЛИ СводныйОтчетОСовершенныхОперацияхОперации.ОснованиеОперации.НомерПорученияВБО ПОДОБНО ""OTC_%"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиЮридическиеФизическиеЛица
		|		ПО (КодыЗагрузкиЮридическиеФизическиеЛица.Владелец = СводныйОтчетОСовершенныхОперациях.ВладелецСчета.ЮридическиеФизическиеЛица)
		|			И (НЕ КодыЗагрузкиЮридическиеФизическиеЛица.ПометкаУдаления)
		|			И (КодыЗагрузкиЮридическиеФизическиеЛица.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.Клиенты))
		|			И (ВЫБОР
		|				КОГДА КодыЗагрузкиЮридическиеФизическиеЛица.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА КодыЗагрузкиЮридическиеФизическиеЛица.ДатаОкончанияДействия > &ТекущаяДата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКонтрагенты
		|		ПО (КодыЗагрузкиКонтрагенты.Владелец = СводныйОтчетОСовершенныхОперациях.ВладелецСчета)
		|			И (КодыЗагрузкиКонтрагенты.Владелец ССЫЛКА Справочник.Контрагенты)
		|			И (НЕ КодыЗагрузкиКонтрагенты.ПометкаУдаления)
		|			И (КодыЗагрузкиКонтрагенты.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.CrmContractNumber))
		|			И (ВЫБОР
		|				КОГДА КодыЗагрузкиКонтрагенты.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				КОГДА КодыЗагрузкиКонтрагенты.ДатаОкончанияДействия > &ТекущаяДата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|ГДЕ
		|	СводныйОтчетОСовершенныхОперациях.Ссылка = &ЭтотСводныйОтчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Операции.TypeCode КАК TypeCode,
		|	ВТ_Операции.PDocDate КАК PDocDate,
		|	ВТ_Операции.PDocNum КАК PDocNum,
		|	ВТ_Операции.CrmClientId КАК CrmClientId,
		|	ВТ_Операции.ContractNumber КАК ContractNumber,
		|	ВТ_Операции.НомерПорученияВБО КАК НомерПорученияВБО
		|ИЗ
		|	ВТ_Операции КАК ВТ_Операции
		|
		|УПОРЯДОЧИТЬ ПО
		|	TypeCode,
		|	НомерПорученияВБО
		|ИТОГИ
		|	МАКСИМУМ(PDocDate),
		|	МАКСИМУМ(PDocNum),
		|	МАКСИМУМ(CrmClientId),
		|	МАКСИМУМ(ContractNumber)
		|ПО
		|	TypeCode";
	Запрос.УстановитьПараметр("ЭтотСводныйОтчет", СводныйОтчетСсылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаТипыОпераций = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТипыОпераций.Следующий() Цикл
			ВыборкаНомераПоручений = ВыборкаТипыОпераций.Выбрать();
			ДанныеДляОдногоСообщения = ПолучитьДанныеДляОдногоСообщения(ВыборкаТипыОпераций, ВыборкаНомераПоручений);
			ДанныеДляВыгрузки.Добавить(ДанныеДляОдногоСообщения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеДляВыгрузки;
КонецФункции

Функция ПолучитьДанныеДляОдногоСообщения(ВыборкаТипыОпераций, ВыборкаНомераПоручений)
	НомераПорученийВБО = Новый Массив;
	Пока ВыборкаНомераПоручений.Следующий() Цикл
		НомерПорученияВБО =
			СтроковыеФункцииКлиентСервер.СтрокаТолькоДопустимыхСимволов(ВыборкаНомераПоручений.НомерПорученияВБО, "0123456789");
		НомерПорученияВБО = СтроковыеФункцииКлиентСервер.ЧислоИзСтроки(НомерПорученияВБО);
		BqId = Новый Структура("BqId", НомерПорученияВБО);
		НомераПорученийВБО.Добавить(BqId);
	КонецЦикла;
	
	ДанныеКОтправке = Новый Структура;
	ДанныеКОтправке.Вставить("PDocDate", ВыборкаТипыОпераций.PDocDate);
	ДанныеКОтправке.Вставить("PDocNum", ВыборкаТипыОпераций.PDocNum);
	ДанныеКОтправке.Вставить("PDocName", "Сводный отчет о совершенных операциях");
	ДанныеКОтправке.Вставить("CrmClientId", ВыборкаТипыОпераций.CrmClientId);
	ДанныеКОтправке.Вставить("ContractNumber", СокрЛП(ВыборкаТипыОпераций.ContractNumber));
	ДанныеКОтправке.Вставить("TypeCode", ВыборкаТипыОпераций.TypeCode);
	ДанныеКОтправке.Вставить("Operations", НомераПорученийВБО);
	
	Возврат ДанныеКОтправке;
КонецФункции

Функция ДанныеДляВыгрузкиИзменились(ПрошлыеДанныеДляВыгрузки, ДанныеДляВыгрузки)
	Если ПрошлыеДанныеДляВыгрузки.Количество() <> ДанныеДляВыгрузки.Количество() Тогда
		Возврат Истина;
	КонецЕсли;

	Для Индекс = 0 По ДанныеДляВыгрузки.Количество() - 1 Цикл
		НовыеДанные = ДанныеДляВыгрузки[Индекс];
		СтарыеДанные = ПрошлыеДанныеДляВыгрузки[Индекс];
		Для Каждого Элемент Из НовыеДанные Цикл
			Если Элемент.Ключ = "Operations" Тогда
				Если Не МассивыСделокИдентичны(НовыеДанные.Operations, СтарыеДанные.Operations) Тогда
					Возврат Истина;
				КонецЕсли;
			Иначе
				Если Элемент.Значение <> СтарыеДанные[Элемент.Ключ] Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция МассивыСделокИдентичны(Массив1, Массив2)
	Идентичны = Истина;
	
	Если Массив1.Количество() <> Массив2.Количество() Тогда
		Идентичны = Ложь;
	Иначе
		Для Индекс = 0 По Массив1.Количество() - 1 Цикл
			Если Массив1[Индекс].BqId <> Массив2[Индекс].BqId Тогда
				Идентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Идентичны;
КонецФункции

Функция ВыгрузитьПервичныйДокумент(ДанныеДляСообщения, СводныйОтчетСсылка)
	
	Сущность = "PrimaryDocs";
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToBqOperationPrimaryDocs1643;
	УИДСообщения = Строка(Новый УникальныйИдентификатор);
	Успешно = Ложь;
	
	Попытка
		MessageInfo = ОбменДаннымиКафка.ТиповыеДанныеMessageInfo(Сущность, "UPD", "1.0.0", УИДСообщения);
		ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, ДанныеДляСообщения);
		Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Сущность, ТекстJSON, УИДСообщения, СводныйОтчетСсылка);
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации("ВыгрузкаПервичныхДокументовВBackQort", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	Возврат Успешно;
КонецФункции

#КонецОбласти
